# Status Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
PostEventArgs..::..Status Property
PostEventArgs Class See Also
---
Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an APIevent handler).
**Namespace:** Autodesk.Revit.DB.Events**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public EventStatus Status { get; }
```

Visual Basic
---
```text
Public ReadOnly Property Status As EventStatus
	Get
```

Visual C++
---
```text
public:
property EventStatus Status {
	EventStatus get ();
}
```

# See Also
PostEventArgs Class
Autodesk.Revit.DB.Events Namespace